Masmiseim36/nxpSDK/boards/frdmke17z/bootloader_examples/freedom_bootloader/pin_mux.h
/*
 * Copyright 2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTE14 (number 17), SW3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITBOOTPIN_SW3_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITBOOTPIN_SW3_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITBOOTPIN_SW3_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITBOOTPIN_SW3_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITBOOTPIN_SW3_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITBOOTPIN_SW3_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBootPin(void);

/*! @name PORTB0 (number 54), RX
  @{ */

/* Symbols to be used with PORT driver */
#define LPUART0_RX_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define LPUART0_RX_PIN 0U                   /*!<@brief PORT pin number */
#define LPUART0_RX_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTB1 (number 53), TX
  @{ */

/* Symbols to be used with PORT driver */
#define LPUART0_TX_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define LPUART0_TX_PIN 1U                   /*!<@brief PORT pin number */
#define LPUART0_TX_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void UART0_InitPins(void);

/*! @name PORTB1 (number 53), TX
  @{ */

/* Symbols to be used with PORT driver */
#define UART0_RESTOREDEFAULT_TX_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define UART0_RESTOREDEFAULT_TX_PIN 1U                   /*!<@brief PORT pin number */
#define UART0_RESTOREDEFAULT_TX_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTB0 (number 54), RX
  @{ */

/* Symbols to be used with PORT driver */
#define UART0_RESTOREDEFAULT_RX_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define UART0_RESTOREDEFAULT_RX_PIN 0U                   /*!<@brief PORT pin number */
#define UART0_RESTOREDEFAULT_RX_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void UART0_RestoreDefault(void);

/*! @name PORTB0 (number 54), RX
  @{ */

/* Symbols to be used with PORT driver */
#define UART0_POLLFORACTIVITY_RX_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define UART0_POLLFORACTIVITY_RX_PIN 0U                   /*!<@brief PORT pin number */
#define UART0_POLLFORACTIVITY_RX_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void UART0_PollForActivity(void);

/*! @name PORTA3 (number 72), SCL
  @{ */

/* Symbols to be used with PORT driver */
#define LPI2C0_SCL_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define LPI2C0_SCL_PIN 3U                   /*!<@brief PORT pin number */
#define LPI2C0_SCL_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTA2 (number 73), SDA
  @{ */

/* Symbols to be used with PORT driver */
#define LPI2C0_SDA_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define LPI2C0_SDA_PIN 2U                   /*!<@brief PORT pin number */
#define LPI2C0_SDA_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void I2C0_InitPins(void);

/*! @name PORTA3 (number 72), SCL
  @{ */

/* Symbols to be used with PORT driver */
#define I2C0_RESTOREDEFAULT_SCL_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define I2C0_RESTOREDEFAULT_SCL_PIN 3U                   /*!<@brief PORT pin number */
#define I2C0_RESTOREDEFAULT_SCL_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTA2 (number 73), SDA
  @{ */

/* Symbols to be used with PORT driver */
#define I2C0_RESTOREDEFAULT_SDA_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define I2C0_RESTOREDEFAULT_SDA_PIN 2U                   /*!<@brief PORT pin number */
#define I2C0_RESTOREDEFAULT_SDA_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void I2C0_RestoreDefault(void);

/*! @name PORTB2 (number 48), SCK
  @{ */

/* Symbols to be used with PORT driver */
#define LPSPI0_SCK_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define LPSPI0_SCK_PIN 2U                   /*!<@brief PORT pin number */
#define LPSPI0_SCK_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTB3 (number 47), SIN
  @{ */

/* Symbols to be used with PORT driver */
#define LPSPI0_SIN_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define LPSPI0_SIN_PIN 3U                   /*!<@brief PORT pin number */
#define LPSPI0_SIN_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTB4 (number 28), SOUT
  @{ */

/* Symbols to be used with PORT driver */
#define LPSPI0_SOUT_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define LPSPI0_SOUT_PIN 4U                   /*!<@brief PORT pin number */
#define LPSPI0_SOUT_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTB5 (number 27), PCS1
  @{ */

/* Symbols to be used with PORT driver */
#define LPSPI0_PCS1_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define LPSPI0_PCS1_PIN 5U                   /*!<@brief PORT pin number */
#define LPSPI0_PCS1_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SPI0_InitPins(void);

/*! @name PORTB5 (number 27), PCS1
  @{ */

/* Symbols to be used with PORT driver */
#define SPI0_RESTOREDEFAULT_PCS1_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define SPI0_RESTOREDEFAULT_PCS1_PIN 5U                   /*!<@brief PORT pin number */
#define SPI0_RESTOREDEFAULT_PCS1_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTB4 (number 28), SOUT
  @{ */

/* Symbols to be used with PORT driver */
#define SPI0_RESTOREDEFAULT_SOUT_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define SPI0_RESTOREDEFAULT_SOUT_PIN 4U                   /*!<@brief PORT pin number */
#define SPI0_RESTOREDEFAULT_SOUT_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTB3 (number 47), SIN
  @{ */

/* Symbols to be used with PORT driver */
#define SPI0_RESTOREDEFAULT_SIN_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define SPI0_RESTOREDEFAULT_SIN_PIN 3U                   /*!<@brief PORT pin number */
#define SPI0_RESTOREDEFAULT_SIN_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTB2 (number 48), SCK
  @{ */

/* Symbols to be used with PORT driver */
#define SPI0_RESTOREDEFAULT_SCK_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define SPI0_RESTOREDEFAULT_SCK_PIN 2U                   /*!<@brief PORT pin number */
#define SPI0_RESTOREDEFAULT_SCK_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SPI0_RestoreDefault(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
